app/controllers/poems_controller.rb

  def index
    @poems = Poem.all
---
SELECT "poems".* FROM "poems"

  def create
    @poem = Poem.new(poem_params)

    respond_to do |format|
      if @poem.save
---
INSERT INTO "poems" ("title", "content", "auther", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "t3"], ["content", "c3"], ["auther", "a3"], ["created_at", "2017-01-09 04:11:55.282116"], ["updated_at", "2017-01-09 04:11:55.282116"]]

  def update
    respond_to do |format|
      if @poem.update(poem_params)
---
UPDATE "poems" SET "auther" = $1, "updated_at" = $2 WHERE "poems"."id" = $3  [["auther", "aa"], ["updated_at", "2017-01-09 04:52:29.950416"], ["id", 3]]

  def destroy
    @poem.destroy
---
DELETE FROM "poems" WHERE "poems"."id" = $1  [["id", 1]]

    def set_poem
      @poem = Poem.find(params[:id])
---
SELECT  "poems".* FROM "poems" WHERE "poems"."id" = $1 LIMIT 1  [["id", 3]]